scripts/putida_stir_small/pH_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     testingPutidaFoam;

startFrom       startTime; //startTime; //latestTime

startTime       0;

//latestTime      0.45;

stopAt          endTime;

endTime         0.009;

deltaT          0.00005;

writeControl    adjustableRunTime;

writeInterval   0.0005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.6;

maxDeltaT       1;

functions
{
    #includeFunc    fieldAverage(U.gas, U.liquid, alpha.gas, p)
    #includeFunc    writeObjects(d.gas, interfaceCompositionPhaseChange:dmidtfSu.O2.gasAndLiquid)
}

/*functions
{
    writeFields
    {
        type writeRegisteredObject;
        functionObjectLibs ( "libIOFunctionObjects.so" );
        objectNames ("thermo:rho.liquid");
        objectNames ("thermo:rho.gas");
        outputControl     outputTime;
    }
}*/


// ************************************************************************* //
